In [1]:
's'

's'

In [12]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

import warnings
warnings.filterwarnings('ignore')

## Import the csv dataset

In [13]:
ds=pd.read_csv('StudentsPerformance.csv')

In [14]:
ds

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [15]:
ds.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [16]:
ds.shape

(1000, 8)

### *Dataset Information*

gender: sex of student->(Male/Female)
race/ethnicity : ethnicity of the student -> (group A,group B,group C,group D)
parent level of educatin: Paretn's final education->(bachelor's ,some college,master's,associate,high school)
lunch : having lunch before test->(standar or free/reduced)
test prepration course: complete or Not complete before test
mathscore reading score writin score

## Data Checks to Perform

Checking Missing Values

Check Duplicates

Check Datatype

Check Number of unique values of each column

check statistics of data set

Check various categories present in Categorical Column

In [23]:
ds.isna().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [25]:
ds.duplicated().sum()

0

In [26]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [27]:
ds.nunique()

gender                          2
race/ethnicity                  5
parental level of education     6
lunch                           2
test preparation course         2
math score                     81
reading score                  72
writing score                  77
dtype: int64

In [28]:
ds.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

From above data absorved 

All means are very close to each other

All std is also very close

min score of math =0,reading =17 and writing=10

In [34]:
print('Category in lunch variable  ',end=" ")
print(ds['lunch'].unique())
print('Category in  gender variable ',end=" ")
print(ds['gender'].unique())
print('Category in lunch ',end=" ")
print(ds['lunch'].unique())
print('Category of parents education',end=" ")
print(ds['parental level of education'].unique())
print('Category of test preparation course',end=" ")
print(ds['test preparation course'].unique())

Category in lunch variable   ['standard' 'free/reduced']
Category in  gender variable  ['female' 'male']
Category in lunch  ['standard' 'free/reduced']
Category of parents education ["bachelor's degree" 'some college' "master's degree" "associate's degree"
 'high school' 'some high school']
Category of test preparation course ['none' 'completed']

In [44]:
numericalf=[feature  for feature in ds.columns if ds[feature].dtype!='O']
print(numericalf)
categoricalf=[feature for feature in ds.columns if ds[feature].dtype=='O']
print(categoricalf)

['math score', 'reading score', 'writing score']
['gender', 'race/ethnicity', 'parental level of education', 'lunch', 'test preparation course']

In [50]:
print('we have {} numerical feature  {} '.format(len(numericalf),numericalf))

we have 3 numerical feature  ['math score', 'reading score', 'writing score']

In [51]:
print('we have {} categorical featue {}'.format(len(categoricalf),categoricalf))

we have 5 categorical featue ['gender', 'race/ethnicity', 'parental level of education', 'lunch', 'test preparation course']

In [53]:
ds['total_score']=ds['math score']+ds['reading score']+ds['writing score']
ds['average']=ds['total_score']/3

In [54]:
ds.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,total_score,average
0,female,group B,bachelor's degree,standard,none,72,72,74,218,72.666667
1,female,group C,some college,standard,completed,69,90,88,247,82.333333
2,female,group B,master's degree,standard,none,90,95,93,278,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,148,49.333333
4,male,group C,some college,standard,none,76,78,75,229,76.333333

In [70]:
mathfull=ds[ds['math score']==100]['average'].count()
readingfull=ds[ds['reading score']==100]['average'].count()
writingfull=ds[ds['writing score']==100]['average'].count()

In [72]:
print(f"Total no of student who scroe full in maths {mathfull}")
print(f"Total no of student who score full in reading {readingfull}")
print(f"Total no of student who score full in writing {writingfull} ")

Total no of student who scroe full in maths 7
Total no of student who score full in reading 17
Total no of student who score full in writing 14

In [73]:
NonQualifymath=ds[ds['math score']<35]['average'].count()
NonQualifyread=ds[ds['reading score']<35]['average'].count()
NonQualifywrite=ds[ds['writing score']<35]['average'].count()

In [74]:
print(NonQualifymath)
print(NonQualifyread)
print(NonQualifywrite)

22
15
17

## Observations
students performed worst in math
Performed well in reading